{
  "jobs": [
    {
      "icon": null,
      "company": "Bright Tech Consulting",
      "location": "Chicago, IL (Remote)",
      "positions": [
        {
          "title": "AI Engineer",
          "start": "September 2025",
          "end": "Present",
          "responsibilities": [
            "Designed and deployed 8+ enterprise-grade multi-agent AI systems for healthcare, manufacturing, and insurance clients, enabling autonomous task execution, workflow routing, and context-aware decision-making across complex operational environments.",
            "Built RAG pipelines using vector databases (Pinecone, Chroma DB) and graph-based reasoning (Neo4j), connecting to Databricks, Snowflake, and SAP to improve response accuracy by 45%.",
            "Orchestrated agent workflows with LangGraph, enabling agents to test APIs, analyze documents, interpret logs, generate code, triage tickets, and integrate with CI/CD ecosystems.",
            "Packaged and deployed models on AWS using Langfuse for real-time telemetry, cost controls, and model switching; ensured systems met security, compliance, and auditability requirements.",
            "Integrated agentic AI systems with legacy applications (ERP systems, SAP ECC, Salesforce), reducing manual process time by 65%."
          ],
          "skills": [
            "RAG",
            "Agentic AI",
            "Python",
            "LangGraph",
            "LangChain",
            "Langfuse",
            "CrewAI",
            "Neo4j",
            "ChromaDB",
            "Pinecone",
            "Streamlit",
            "Databricks",
            "Snowflake",
            "SAP",
            "MCP",
            "A2A",
            "GCP",
            "Vertex",
            "Blob Storage",
            "Generative AI",
            "LLM",
            "SLM",
            "Agile",
            "Consulting",
            "Milvus",
            "fastapi",
            "fastmcp",
            "pytest",
            "pandas",
            "pydantic",
            "PyTorch",
            "Chat-GPT",
            "Claude",
            "Gemini",
            "Microsoft SQL Server"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "CellTrak Technologies (A Homecare Homebase Company)",
      "end": "September 2025",
      "start": "October 2015",
      "location": "Schaumburg, IL (remote)",
      "condensed": {
        "title": "Software Engineer Manager | Site Reliability Focus",
        "responsibilities": [
          "Led a 5-person team to stabilize enterprise systems, reducing support overhead many times over via AI-enhanced knowledge bases and custom tooling.",
          "Architected cloud-native CI/CD pipelines (Jenkins, EventBridge) and automated remediation, cutting deployment time from days to minutes with 0% downtime.",
          "Co-developed an agentic AI solution that autonomously resolved 90% of billing rejections by analyzing deficiencies and resubmitting claims with qualified data.",
          "Engineered self-healing systems using Concierge, reducing MTTR by 35% through proactive alerting and feedback loops.",
          "Directed schema migration and data archiving via Airflow and Snowflake, optimizing database performance 30%.",
          "Championed hiring and onboarding for engineers of all levels, aligning talent acquisition with technical and cultural standards.",
        ],
        "skills": [
          "AWS",
          "Agentic AI",
          "Agile",
          "Communication Skills",
          "Concierge",
          "Datadog",
          "GCP",
          "Jenkins",
          "Jira",
          "Kubernetes",
          "Lambda",
          "LangGraph",
          "Leadership",
          "Management",
          "MariaDB",
          "MySQL",
          "Node.js",
          "PHP",
          "Point of Contact",
          "Project Management",
          "Python",
          "RAG",
          "React",
          "Svelte",
          "Symfony",
          "TDD",
          "Transparency"
        ]
      },
      "positions": [
        {
          "title": "Software Engineer Manager | Site Reliability Focus",
          "start": "November 2021",
          "end": "September 2025",
          "responsibilities": [
            "Led a 5-person team to stabilize enterprise systems, reducing support overhead many times over via AI-enhanced knowledge bases and custom tooling.",
            "Architected cloud-native CI/CD pipelines (Jenkins, EventBridge) and automated remediation, cutting deployment time from days to minutes with 0% downtime.",
            "Co-developed an agentic AI solution that autonomously resolved 90% of billing rejections by analyzing deficiencies and resubmitting claims with qualified data.",
            "Engineered self-healing systems using Concierge, reducing MTTR by 35% through proactive alerting and feedback loops.",
            "Directed schema migration and data archiving via Airflow and Snowflake, optimizing database performance 30%.",
            "Championed hiring and onboarding for engineers of all levels, aligning talent acquisition with technical and cultural standards.",
            "Built custom deployment architecture and internal tooling to empower QA and dev teams, enhancing velocity and cross-functional collaboration."
          ],
          "skills": [
            "Datadog",
            "PHP",
            "Svelte",
            "Python",
            "Jenkins",
            "Docker",
            "Kubernetes",
            "AWS",
            "EventBridge",
            "Lambda",
            "Symfony",
            "CloudWatch",
            "Jira",
            "OpsGenie",
            "Vertex",
            "RAG",
            "Agentic AI",
            "LangChain",
            "LangGraph",
            "GCP",
            "Chat-GPT",
            "Claude",
            "Gemini",
            "Salesforce",
            "Transparency",
            "Communication Skills",
            "Agile",
            "Project Management",
            "UI Design",
            "React",
            "Redux",
            "TypeScript",
            "MariaDB",
            "Postgres",
            "ChromaDB",
            "Pinecone",
            "FastAPI",
            "Bash",
            "Management",
            "Ansible",
            "Terraform",
            "Wiz",
            "Node.js",
            "Point of Contact",
            "Concierge",
            "Informer",
            "Vitest",
            "PHPUnit",
            "Jest",
            "Playwright",
            "TDD"
          ]
        },
        {
          "title": "Software Engineer Manager | Interoperability Focus",
          "start": "May 2020",
          "end": "October 2021",
          "responsibilities": [
            "Spearheaded the design and implementation of a critical thinking driven hiring framework that improved confidence in a candidate's potential performance",
            "Recruited and onboarded two top-tier senior software engineers, resulting in 25% higher team productivity through strategic technical and cultural alignment",
            "Architected 5+ EMR interfaces using modern API standards, enhancing interoperability and user experience for partner healthcare providers",
            "Led cross-functional transformation initiatives with EMR partners and stakeholders that modernized critical interfaces and streamlined operations, directly contributing to HCHB acquisition",
            "Resolved critical system failures by conducting deep-dive analysis of legacy interface code and implementing comprehensive documentation that improved system reliability and shared comprehension",
            "Engineered innovative data remediation solutions for 20+ critical issues, ensuring data integrity and operational continuity",
            "Pioneered a support-first policy for EMR vendor interactions that streamlined vendor and customer interactions, reducing confusion and improving external perception of the product",
            "Proactively embedded in Technical Support scrums to accelerate ticket resolution by 25% and enhance cross-departmental synergy through real-time assistance",
            "Managed both the T3 Technical Support Team and Interops team for about 6 months, managing 7 engineers total"
          ],
          "skills": [
            "PHP",
            "Symfony",
            "Jira",
            "Python",
            "Management",
            "Transparency",
            "Docker",
            "MariaDB",
            "Bash",
            "Concierge",
            "Project Management",
            "Jenkins",
            "Agile",
            "Point of Contact",
            "Microsoft SQL Server",
            "React",
            "Jest",
            "Node.js",
            "JavaScript",
            "TDD"
          ]
        },
        {
          "title": "Platform Engineer",
          "start": "November 2019",
          "end": "April 2020",
          "skills": [
            "Python",
            "Kubernetes",
            "Helm",
            "Docker",
            "AWS",
            "Ansible",
            "Chef",
            "Datadog",
            "Jira",
            "Project Management",
            "Agile",
            "Point of Contact",
            "Node.js",
            "MariaDB"
          ],
          "responsibilities": [
            "Launched a high-impact remediation initiative to resolve several critical system failures, greatly improving system stability",
            "Spearheaded end-to-end cloud deployment transformation that reduced deployment time from 7+ days to sub-2 minutes with 0% downtime, enabling daily releases and immediate hotfix patching through DevOps optimization",
            "Engineered a dynamic schema migration suite that automated database updates during deployments, reducing migration failures by 99% and increasing responsiveness in high impact areas",
            "Pioneered a data archiving framework using Snowflake and Airflow that shrunk transactional databases by 80%, improving query performance by 12,000% in high demand areas",
            "Orchestrated cross-functional support engagement with Technical Support teams, resolving 24+ hour critical incidents in <4 hours and reducing average ticket resolution time by 30% through real-time triage"
          ]
        },
        {
          "title": "Senior Software Engineer",
          "start": "October 2015",
          "end": "October 2019",
          "skills": [
            "PHP",
            "Symfony",
            "React",
            "Electron",
            "Vagrant",
            "Docker",
            "AWS",
            "EC2",
            "Jenkins",
            "Bash",
            "Desktop Deployment",
            "Leadership",
            "Jira",
            "Agile",
            "MySQL",
            "MariaDB",
            "Windows Office Administrator",
            "Meta Programming"
          ],
          "responsibilities": [
            "Proved myself to be a valuable leader after 1 year and led several cross-functional initiatives as the lead in pods of 4 senior engineers",
            "Architected a custom SPA framework blending React and Angular capabilities to accelerate feature delivery optimized for our companies needs",
            "Engineered high-throughput API systems for mobile event processing, enabling 10K+ hourly transactions with 99.95% reliability through asynchronous event streaming",
            "Leveraged Rails best practices to modernize PHP framework architecture, improving core functionality and reducing bug rates by 20% and marginally increasing readability across monolithic legacy application",
            "Drove rapid feature development by leveraging the strengths of Symfony through reusable component patterns",
            "Cultivated a learning culture that increased peer technical proficiency via mentorship programs and knowledge-sharing initiatives",
            "Orchestrated Vagrant environment standardization, maintaining 100% dev consistency across 20+ environments despite co-lo to cloud system migrations",
            "Designed QA-ready deployment architecture that reduced testing cycles by 35%, aggressively accelerating time from code complete to production launch",
            "Synchronized geographically distributed teams in an Electron/React ecosystem, ensuring 99% feature alignment across 4 global time zones"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "Active Campaign",
      "location": "Chicago, IL",
      "positions": [
        {
          "title": "Software Engineer / Technical Lead",
          "start": "March 2019",
          "end": "November 2019",
          "responsibilities": [
            "Drove modernization of legacy PHP systems using AWS, improving reliability and scalability. Improving customer onboarding processing times by 200%",
            "Architected customer-facing features using Ember.js and PHP that increased platform engagement by 35% through intuitive UX redesigns",
            "Cultivated a high-impact mentorship program that accelerated junior engineer proficiency by 40%, reducing onboarding time by 25% across 4 teams",
            "Orchestrated end-to-end automation for CSV payload ingestion, eliminating 70% of manual effort and saving 40 hours of customer onboarding on average",
            "Engineered a zero-failure JSON batch processing pipeline handling 10K+ daily imports, cutting data import errors by 95% and boosting customer satisfaction by 25%"
          ],
          "skills": [
            "Ember",
            "PHP",
            "Custom Framework",
            "JSOND",
            "Kafka",
            "Docker",
            "Node.js",
            "UI Design",
            "NPM",
            "SQS",
            "GitHub",
            "GitLab",
            "Jira",
            "Jest",
            "PHPUnit",
            "Kubernetes",
            "Git",
            "TDD",
            "Meta Programming",
            "MySQL"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "Springleaf Financial Services",
      "location": "Chicago, IL",
      "positions": [
        {
          "title": "Senior Backend Engineering & Microservices Strategy",
          "start": "May 2015",
          "end": "October 2015",
          "responsibilities": [
            "Engineered features within a multi-service RESTful API ecosystem, driving scalability and seamless service integration.",
            "Designed and expanded microservices architecture strategy, accelerating new service creation by 50%.",
            "Developed Ruby-based backend functionality, ensuring reliability and performance across distributed systems.",
            "Built reusable engines for cross-application consistency, embedding self-testing and standardized code idioms.",
            "Mentored a 50+ engineer team through peer reviews and best practices; enforced GitHub rebase/commit workflows.",
            "Leveraged Sidekiq and Redis for idempotent, multi-threaded background tasks, boosting system throughput 30%."
          ],
          "skills": [
            "Redis",
            "Sidekiq",
            "Ruby",
            "Ruby on Rails",
            "Microservices",
            "Mentoring",
            "Meta Programming",
            "MySQL",
            "Postgres",
            "TDD",
            "Jira"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "iCrossing",
      "about": "",
      "location": "Chicago, IL",
      "positions": [
        {
          "title": "Full-Stack Senior Engineer / Cross-Functional \"Fixer\" Team",
          "start": "October 2011",
          "end": "May 2015",
          "responsibilities": [
            "Delivered data visualization platforms with D3.js, enabling users to uncover insights by connecting siloed datasets.",
            "Operated in a high-impact \"fixer\" team, tackling complex marketing systems and multi-platform digital experiences.",
            "Rapidly adopted emerging frameworks (Sinatra, Ember, Backbone, Angular) to accelerate delivery.",
            "Contributed to architecture and scaling of microservices for an enterprise business platform.",
            "Engineered multi-platform UI/UX using SCSS, CSS, JavaScript, jQuery, and EXT.js.",
            "Managed CentOS-based environments for staging/deployment, optimizing infrastructure reliability.",
            "Created and maintained customer related products on Heroku for faster and cost-effective deployments.",
            "Championed code quality with Kane and Rubocop, embedding best practices into the development lifecycle."
          ],
          "skills": [
            "D3.js",
            "EXT.js",
            "Backbone",
            "Ember",
            "Sinatra",
            "jQuery",
            "SCSS",
            "CSS",
            "Bash",
            "System Administration",
            "Jira",
            "Kane",
            "Rubocop",
            "Agile",
            "CoffeeScript",
            "GitLab",
            "Git",
            "Ruby",
            "Ruby on Rails",
            "Java",
            "Maven",
            "Groovy",
            "MySQL",
            "Postgres",
            "UX Design",
            "Apache",
            "Jenkins",
            "Fedora",
            "CentOS",
            "WordPress",
            "Heroku",
            "TDD",
            "VMWare"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "ISP Painting",
      "about": "",
      "location": "Naperville, IL",
      "positions": [
        {
          "title": "Full-Stack Engineer",
          "start": "December 2010",
          "end": "September 2011",
          "responsibilities": [
            "Championed full-stack ownership across 5+ technical domains (SysAdmin, DevOps, PHP, DB, UI/UX)",
            "Spearheaded user-centric feature prioritization, aligning 40+ requests with roadmap velocity to deliver 25% faster time-to-market for key initiatives",
            "Leveraged AJAX, VMWare, and modern JavaScript to decrease page load times and add page responsiveness"
          ],
          "skills": [
            "VMWare",
            "Subversion",
            "Zendesk",
            "PHP",
            "Custom Framework",
            "System Administration",
            "Windows Office Administrator",
            "MySQL",
            "Database Admin",
            "Endpoint Maintenance",
            "jQuery",
            "EXT.js",
            "UX Design",
            "UI Design",
            "Licensing",
            "Co-lo management",
            "Bash",
            "mainframe development",
            "SharePoint",
            "WordPress",
            "Jira",
            "Point of Contact"
          ]
        }
      ]
    },
    {
      "icon": null,
      "company": "Just5Clicks",
      "location": "Wauconda, IL",
      "positions": [
        {
          "title": "Full-Stack Engineer",
          "start": "September 2010",
          "end": "November 2010",
          "responsibilities": [
            "Migrated non-modular PHP/ASP.NET monoliths to a modular PHP library, reducing technical debt by 35% and cutting feature delivery time by 25%, removing the need to copy and paste code",
            "Engineered 15+ end-to-end automation workflows that eliminated 20+ hours/week of manual labor, enabling our rag-tag team of engineers to focus on feature development",
            "Optimized SQL queries and schemas to reduce query time by 75%, increase feature development time significantly, and allow for security around sensitive data points"
          ],
          "skills": [
            "Subversion",
            "Java",
            "ASP.net",
            "IIS",
            "Microsoft SQL Server",
            "PHP",
            "Photoshop",
            "Illustrator",
            "JavaScript",
            "jQuery",
            "CSS",
            "HTML",
            "OOP",
            "MVC",
            "Jira",
            "Building Management",
            "Automation",
            "Debugging",
            "Test Automation",
            "Waterfall",
            "OCR",
            "EXT.js"
          ]
        }
      ]
    },
    {
      "icon": null,
      "about": "",
      "company": "Sears Holdings Corporation",
      "location": "Hoffman Estates, IL",
      "positions": [
        {
          "title": "Frontend Engineer",
          "start": "August 2009",
          "end": "September 2010",
          "responsibilities": [
            "Successfully prioritized and delivered 10+ concurrent projects—including high-impact initiatives and personal work—while consistently exceeding expectations amidst a high-volume, detailed workload",
            "Transitioned to a highly technical frontend engineering role, accelerating feature delivery by 20% through OOP jQuery class and module design",
            "Enhanced a shared jQuery library utilized by 40+ frontend engineers, improving component reusability by 30% and reducing development time by 15%"
          ],
          "skills": [
            "jQuery",
            "DreamWeaver",
            "Photoshop",
            "Flash",
            "JavaScript",
            "Java",
            "CSM",
            "WordPress",
            "Point of Contact"
          ]
        }
      ]
    },
    {
      "icon": null,
      "about": "",
      "company": "Tom Rowe and Associates",
      "location": "Harlingen, TX (Remote)",
      "website": "https://www.tomrowe.com/",
      "positions": [
        {
          "title": "Frontend Developer",
          "start": "March 2009",
          "end": "August 2009",
          "responsibilities": [
            "Led full lifecycle web development—from initial client consultation to successful launch—for 10+ projects, ensuring alignment with business goals and user needs.",
            "Rapidly prototyped and deployed 5+ micro-sites for new product introductions, leveraging Flash to deliver immersive and engaging user experiences.",
            "Designed and implemented custom visual assets using Adobe Photoshop and Illustrator, integrating them seamlessly into responsive HTML/CSS layouts for optimal cross-browser compatibility."
          ],
          "skills": [
            "ASP.net",
            "Flash",
            "HTML",
            "CSS",
            "Photoshop",
            "Illustrator",
            "IIS",
            "SharePoint",
            "WordPress",
            "Custom Framework"
          ]
        }
      ]
    }
  ],
  "skills": [
    {
      "name": "PHP",
      "level": "Expert",
      "years": "15+",
      "type": "Programming Language",
      "details": "PHP was my first programming language back in the early 2000s. While it hasn't always been the main language that I use when working at a job it is always around in some way. For my almost 10 years at CellTrak many of our main projects were built in PHP and used Symfony."
    },
    {
      "name": "EXT.js",
      "level": "Expert",
      "years": "3+",
      "type": "JavaScript Framework",
      "details": "I haven't worked with EXT.js since 2015. I'm not too worried about that since I think it's fallen out of popularity. But I worked in it day in and day out for a few years. If needed I could probably pick it up very quickly, again."
    },
    {
      "name": "Python",
      "type": "Programming Language",
      "level": "Expert",
      "years": "7+",
      "details": "Python has dominated my work as I do more and more with AI. I have several of years of experience with it for everything from scripting, to full on frameworks. It's been integral in the adoption of microservices in AWS, to the foundational language of machine learning and AI orchestration. Luckily, it's a fun language to work with, but there's always more to learn."
    },
    {
      "name": "LangGraph",
      "type": "AI Framework (Multi-agent Orchestration)",
      "level": "Expert",
      "years": "2+",
      "details": "In the past two years, I’ve turned complex business chaos into autonomous execution using LangGraph. As an AI Engineer at Bright Tech, I orchestrated 8+ enterprise multi-agent systems for healthcare, insurance, and manufacturing clients—where agents don’t just do tasks, they autonomously test APIs, triage tickets, generate code, and even fix broken CI/CD pipelines. This didn’t just save time: it slashed manual process time by 65% and enabled clients to run workloads without human hand-holding. Now, I’m building the next generation of agentic AI where LangGraph isn’t just a tool—it’s the nervous system of smart, self-healing systems."
    },
    {
      "name": "SharePoint",
      "type": "Collaboration/Content Management Platform",
      "level": "Intermediate",
      "years": "4",
      "details": "During my time at Tom Rowe and ISP Painting, I leveraged SharePoint for project tracking, budget management of software licenses, and cross-team coordination. I was responsible for maintaining project documentation, tracking license allocations, and providing technical support for end-users related to system access and troubleshooting. I utilized SharePoint’s features to streamline internal processes and ensure effective information sharing between development and non-technical teams. And for technical teams we used it to share documents anda launch new projects from roughs down to IIS management for development and production environments."
    },
    {
      "name": "IIS",
      "type": "Web Server",
      "level": "Intermediate",
      "years": "4 (Intermittent)",
      "details": "I cut my teeth on IIS (Internet Information Services) at Just5Clicks, where I rapidly learned its intricacies to optimize web application performance and stability. This foundational knowledge became invaluable at ISP Painting, a fully Windows-based server environment where I leveraged deep IIS expertise to maintain uptime and scale infrastructure. While IIS wasn’t a daily focus throughout my career, my experience proved essential when troubleshooting a legacy Windows Server product at CellTrak and supporting co-located projects within Homecare Homebase (HCHB). I’m comfortable diving back into IIS configurations—because when it comes to Windows server infrastructure, I know where to look and what to fix."
    },
    {
      "name": "Illustrator",
      "type": "Vector Graphics Editor / Design Tool",
      "level": "Expert",
      "years": "15+",
      "details": "Early in my career, Adobe Illustrator was a core part of my front-end toolkit – I designed icons, logos, and even full website mockups to bring concepts to life. While my focus shifted over time, I consistently returned to Illustrator for professional projects, crafting visual elements when pixel-perfect precision was critical. And it’s not just work: Illustrator remains a passion. Whether I’m refining a user interface or designing a custom bookcase before committing it to wood, it’s a helpful tool for visualizing ideas and turning them into reality."
    },
    {
      "name": "Photoshop",
      "type": "Raster Graphics Editor / Image Manipulation",
      "level": "Expert",
      "years": "15+",
      "details": "Photoshop was a key part of my front-end toolkit earlier in my career, used for creating and refining website visuals. While my professional focus evolved, I've consistently relied on Photoshop for projects requiring detailed image editing and manipulation. Beyond work, it’s become a personal playground—I love transforming ordinary family photos into something truly special, adding a little extra \"pizazz\" to capture those memories. Whether it’s a professional mockup or a playful photo edit, Photoshop remains a constant creative outlet."
    },
    {
      "name": "CSS",
      "type": "Styling Language (Front-end development)",
      "level": "Expert",
      "years": "15+",
      "details": "For over 15 years, CSS has been fundamental to my front-end work, with a strong focus on responsive design and cross-browser compatibility. While I may not be writing CSS daily, I’m constantly exploring the evolving landscape of web styling – particularly the power of CSS math and animations to create dynamic, engaging user experiences. I actively dissect innovative designs I find online, reverse-engineering layouts and techniques to expand my knowledge and push the boundaries of what's possible with CSS. I believe in a continual learning approach to stay ahead of the curve in this ever-changing field."
    },
    {
      "name": "HTML",
      "type": "Markup Language (Front-end development)",
      "level": "Expert",
      "years": "15+",
      "details": "For over 15 years, HTML has been the cornerstone of my web development work. Beyond simply knowing the tags, I prioritize writing semantic, accessible, and standards-compliant code – ensuring projects are built on a solid foundation. I actively follow the evolving HTML specification from the W3C, embracing new elements and features as they emerge to create modern, sleek, and future-proof web experiences. Maintaining a deep understanding of HTML best practices is non-negotiable for delivering high-quality, sustainable web solutions."
    },
    {
      "name": "Flash",
      "type": "Multtimedia Platform / Rich Internet Application",
      "level": "Expert (Historical)",
      "years": "3",
      "details": "Adobe Flash was transformative for me, igniting my passion for programming during my college years and early freelance work. Creating interactive marketing solutions with Flash sparked my interest in coding, ultimately leading me down the path of software development. While the technology has since been superseded by Canvas and other modern standards, it laid the foundation for my career – and I might not have discovered my love for building software without it. My time with Flash instilled a deep understanding of interactivity, animation, and the fundamentals of creating engaging digital experiences."
    },
    {
      "name": "ASP.net",
      "type": "Web Application Framework",
      "level": "Novice",
      "years": "~2 (maintenance and migration)",
      "details": "While not a primary development focus, I have experience maintaining and interacting with ASP.NET applications. My work primarily involved troubleshooting existing systems and, more frequently, migrating functionality to PHP-based solutions. I possess a functional understanding of the framework and its core concepts, enabling me to effectively bridge the gap between ASP.NET and other technologies."
    },
    {
      "name": "Java",
      "type": "Programming Language",
      "level": "Novice ",
      "years": "~1 year (Maintenance and Migration)",
      "details": "my work with Java primarily involved maintaining existing applications, addressing minor bugs, and implementing small feature enhancements. I’ve also frequently converted Java-based functionality to other languages. While I haven’t engaged in large-scale Java development, I possess a solid understanding of the language and can effectively read, comprehend, and troubleshoot Java codebases."
    },
    {
      "name": "CSM",
      "type": "System Design / Feature Management",
      "level": "Expert",
      "years": "~8 (Aggregate)",
      "details": "In my early freelance work, I pioneered custom content and component management solutions long before modern library repositories and CMS frameworks were commonplace. Faced with the challenge of managing swappable features from scratch, I built systems to track, deploy, and maintain complex website functionality. While later frameworks like WordPress effectively duplicated aspects of this work, it served as validation of my approach – and a testament to my ability to anticipate and solve evolving web development challenges."
    },
    {
      "name": "WordPress",
      "type": "Content Management System",
      "level": "Expert",
      "years": "~3 (intermittent)",
      "details": "While building custom web solutions as a freelancer, I extensively evaluated and integrated WordPress into various projects. I recognized its potential to streamline content management and rapidly deploy features – functionality I had previously built from scratch. Though WordPress ultimately served as a viable alternative to some of my custom solutions, it reinforced the value of my early work in defining core CMS principles and building scalable content architectures. Also, WordPress just keeps popping up. My friend needs a favor with his site, it was built in WordPress. The company has an information based web presence, it's written in WordPress. Someone sends me some side work, guess what, they want a WordPress site. Every time, LOL."
    },
    {
      "name": "JavaScript",
      "type": "Programming Language (Full-stack development)",
      "level": "Expert",
      "years": "15+",
      "details": "JavaScript has been my go-to language since the beginning – and remains my absolute favorite. While professional opportunities haven’t always allowed for consistent, dedicated JavaScript work, I consistently return to it for its versatility and power. From simple front-end enhancements to leveraging Node.js for rapid prototyping and embracing the benefits of TypeScript’s strong typing, I appreciate JavaScript's ability to adapt to virtually any web development challenge. Its asynchronous nature presents both opportunities and complexities, but overall, it’s the indispensable Swiss Army knife of the web."
    },
    {
      "name": "DreamWeaver",
      "type": "Web Development Tool",
      "level": "Expert",
      "years": "~3 (Early Career)",
      "details": "While initially used as a learning aid to grasp the fundamentals of HTML and CSS, Dreamweaver proved unexpectedly powerful during my time at Sears. I leveraged its capabilities to automate a significant portion of our front-end ad generation workflow, creating a reusable code library that dramatically reduced team workload. What started as a 15-person team working 80-hour weeks was transformed – following adoption, we consistently operated at 40-50 hours, representing nearly a 45% increase in productivity. To this day, that automation earns me a free beer or two whenever I reconnect with my former colleagues."
    },
    {
      "name": "JQuery",
      "type": "JavaScript Framework",
      "level": "Expert",
      "years": "8+",
      "details": "Although often considered a relic of the past, jQuery was the first true JavaScript framework and a pivotal technology in my development journey. My rapid adoption of jQuery set me apart from many front-end designers, introducing me to the complex world of JavaScript object-oriented programming and enabling the creation of highly interactive web experiences. While I occasionally encounter jQuery in legacy projects, much of its foundational concepts are embedded within modern frameworks – ensuring my skills remain relevant and readily adaptable."
    },
    {
      "name": "OCR",
      "type": "Image Processing / Data Extraction",
      "level": "Expert",
      "years": "5+ (More intense training and early adoption at Just5Clicks)",
      "details": "At Just5Clicks, I was deeply involved in the daily implementation of OCR technology for standardized test grading. This involved training the system to accurately identify filled-in circles based on pencil mark variations, then extracting the corresponding answer letter within each section. This pioneering work – predating widespread adoption of modern image recognition techniques like those found in PyTorch – was a challenging frontier, rife with issues like data hallucination and misrepresentation, problems that continue to plague computer vision today.<br/>PHP served as the ideal platform for integrating and deploying OCR solutions, leveraging its robust functional library for image processing and data extraction. While my initial intensive work with OCR occurred at Just5Clicks, I continued to implement the technology at iCrossing and SpringLeaf, where it had matured into a more reliable and easily deployable tool."
    },
    {
      "name": "Waterfall",
      "type": "Project Management Methodology",
      "level": "Expert (Unfortunately)",
      "years": "~8 (Aggregate)",
      "details": "I have firsthand experience with the Waterfall methodology, spanning multiple implementations throughout my career, including a recent project at HCHB (CellTrak). While historically significant, I strongly believe Waterfall is an inefficient and inflexible approach to project management. I have witnessed its limitations – and the resulting frustrations – repeatedly and actively seek opportunities to implement more agile and iterative methodologies. To put it simply: I do not like waterfall, I do not like it in a job, I do not like it with at all, I do not like that waterfall."
    },
    {
      "name": "Test Automation",
      "type": "Software Quality Assurance / DevOps",
      "level": "Expert",
      "years": "10+",
      "details": "I began implementing test automation practices at Just5Clicks before it was widely adopted, recognizing its potential to drastically improve software quality and accelerate delivery. Today, test automation is integral to everything from data and code validation to comprehensive build and behavioral testing. I’m a strong advocate for incorporating automated testing and monitoring into modern CI/CD pipelines, and I proactively champion the creation of automated scenarios to prevent downtime and ensure seamless production deployments."
    },
    {
      "name": "Debugging",
      "type": "Problem Solving / Software Diagnostics",
      "level": "Expert",
      "years": "15+",
      "details": "I possess a strong analytical ability to systematically investigate and resolve complex software issues. I excel at thinking through system architecture and interpreting error messages to pinpoint the root cause of bugs efficiently. Through extensive experience, I've observed that effective debugging is a skill often underestimated – and that many developers spend significantly more time pursuing irrelevant paths. I consistently minimize diagnostic time by focusing on logical deduction and targeted investigation."
    },
    {
      "name": "Automation",
      "type": "Process Optimization / Software Engineering",
      "level": "Expert / Champion",
      "years": "15+",
      "details": "Automation is not just a skill, but a core principle of my work. From the moment a task is completed, I immediately consider how to automate it, driving consistent productivity gains throughout my career. I’ve repeatedly been recognized and rewarded for automating tedious or problematic elements within the software industry—ranging from bug fixes and data integration to complex deployments and platform compliance. These successes were often quietly implemented, resolving pain points and allowing teams to focus on new challenges. I’m eager to further champion automation initiatives, simplifying workflows and enabling a focus on innovation."
    },
    {
      "name": "Building Management",
      "type": "Administrative / Operational Support",
      "level": "Intermediate",
      "years": "~3 (aggregate)",
      "details": "Throughout my involvement with several small companies, I've consistently contributed to essential business operations beyond my core technical role. This includes hands-on building management tasks, ranging from facilities access and maintenance to administrative duties like vendor management and bill payment. While often an underrated aspect of running a business, I recognize its necessity and value contributing to a smooth and functional work environment."
    },
    {
      "name": "MVC",
      "type": "Architecture Pattern / Software Design",
      "level": "Expert",
      "years": "10+",
      "details": "MVC is a fundamental architectural pattern for developing user interfaces. It separates application logic (Model), data presentation (View), and user input handling (Controller), fostering code organization, maintainability, and testability. This separation of concerns is crucial for building scalable and robust web applications."
    },
    {
      "name": "OOP",
      "type": "Programming Paradigm",
      "level": "Expert",
      "years": "15+",
      "details": "Object-Oriented Programming has been a cornerstone of my development approach throughout my career. I recognize its fundamental importance in building reusable, modular, and scalable code – particularly within complex systems. OOP principles facilitate code organization, maintainability, and extensibility, leading to more robust and efficient software solutions."
    },
    {
      "name": "Microsoft SQL Server",
      "type": "Relational Database Management System (RDBMS)",
      "level": "intermediate",
      "years": "~3 (aggregate)",
      "details": "I have experience with Microsoft SQL Server gained across multiple roles, including recent work at CellTrak and earlier experience at Just5Clicks. While not a dedicated database administrator, I’ve regularly utilized SQL for data retrieval, troubleshooting, and assisting with vendor integrations. Currently at Bright Tech, my understanding of SQL is valuable for comprehending data extraction requirements and supporting customer support initiatives."
    },
    {
      "name": "Subversion",
      "type": "Version Control System",
      "level": "Expert",
      "years": "4 (early career)",
      "details": "I have been a consistent and strong advocate for version control throughout my career, beginning with extensive use of Subversion early on. From small personal projects to larger team efforts at ISP Painting, I recognize the critical importance of tracking changes, collaborating effectively, and maintaining a comprehensive project history."
    },
    {
      "name": "Point of Contact",
      "type": "Communication / Relationship Management",
      "level": "Expert",
      "years": "10+",
      "details": "My expertise and relatable communication style have been paired several times with point-of-contact work. I'm often the company's counterpart with consultants and have been the right hand on touchy, complicated support calls. I have often been used as the reason for customer retention thanks to my ability to stay calm and demonstrate fairness, equity, and accountability in the development cycle or to our customers in need."
    },
    {
      "name": "Mainframe Development",
      "type": "Infrastructure Support / System Administration",
      "level": "Expert",
      "years": "~1",
      "details": "I have experience maintaining, operating, and facilitating coding environments within mainframe-style setups. My contributions have focused on supporting development processes and ensuring the smooth functioning of these environments."
    },
    {
      "name": "Bash",
      "type": "Scripting Language, System Administration, and DevOps",
      "level": "Expert",
      "years": "12+",
      "details": "I have been a consistent user of Bash scripting since my time at ISP Painting, leveraging it for system administration at both ISP Painting and iCrossing. This included maintaining endpoint compliance and updates within CentOS environments, and continued at CellTrak upon my arrival. Beyond daily administration, this foundational knowledge has been instrumental in my evolution toward modern infrastructure concepts, seamlessly bridging the gap between manual server configuration and code-as-configuration principles within cloud systems and microservice architectures."
    },
    {
      "name": "Co-lo management",
      "level": "Expert / Enthusiast",
      "type": "Infrastructure / System Administration",
      "years": "4 professional and 15+ personal",
      "details": "I have experience managing server infrastructure in co-location facilities during my early career. This experience has evolved into a continuing personal interest – I actively maintain a home server environment for experimentation with software, APIs, and emerging technologies, providing a hands-on platform for continuous learning and skill development."
    },
    {
      "name": "Licensing",
      "type": "DevOps / Compliance",
      "level": "Novice",
      "years": "~1",
      "details": "During my time at ISP Painting, I gained practical experience in managing Microsoft Server licensing. This involved understanding licensing models, ensuring compliance, and optimizing costs associated with Windows server infrastructure, providing valuable insight into the financial aspects of IT systems."
    },
    {
      "name": "UI Design",
      "type": "Front-end Development / Visual Design",
      "level": "Intermediate",
      "years": "15+",
      "details": "While not a dedicated visual designer, I readily embrace UI implementation, particularly adapting and extending existing themes to create cohesive and functional elements. As a seasoned backend developer, UI work provides a welcome creative outlet, ensuring a consistent and user-friendly front-end experience."
    },
    {
      "name": "UX Design",
      "type": "Interaction Design / User Experience",
      "level": "Enthusiast",
      "years": "~12 (aggregate)",
      "details": "I am passionate about understanding user behavior and designing intuitive software experiences. I actively research UX best practices (including studies from leading tech companies) and engage in observational analysis of user interactions – both internal and external – to identify opportunities for improving quality of life and overall usability."
    },
    {
      "name": "Endpoint Maintenance",
      "type": "IT Support / Troubleshooting / Help Desk Support",
      "level": "Intermediate",
      "years": "Ongoing (Professional and extended family support)",
      "details": "I gained hands-on experience with endpoint maintenance and help desk support during my time at ISP Painting, resolving hardware and software issues for internal users. This professional experience has naturally extended beyond the workplace – I am the go-to IT resource for family and friends, providing ongoing support and troubleshooting for a wide range of devices and technical challenges (thankfully, without the need to manage system policy updates!)."
    },
    {
      "name": "Database Admin",
      "type": "DevOps",
      "level": "Intermediate",
      "years": "~1 (Non-cloud)",
      "details": "My experience with database administration extends beyond software – I’ve been responsible for the full lifecycle of physical database servers, including hardware maintenance, cooling, network connectivity, and licensing. This hands-on experience, which included late-night emergency repairs (yes, even replacing fans on internet switches at 3 am!), provided a foundational understanding of how services and microservices interconnect and depend on robust infrastructure."
    },
    {
      "name": "MySQL",
      "type": "Relational Database Management System (RDBMS)",
      "level": "Expert",
      "years": "15+",
      "details": "MySQL was my first experience with relational databases and provided a foundational understanding that I've consistently leveraged throughout my career. I have delved into the deeper aspects of MySQL documentation and followed database updates, establishing a strong base for working with other RDBMS technologies."
    },
    {
      "name": "MariaDB",
      "type": "Relational Database Management System (RDBMS)",
      "level": "Expert",
      "years": "15+ (starting when it was MySQL)",
      "details": "I’ve been working with MariaDB extensively for the past seven years, leveraging a strong foundation built on 8+ years of experience with MySQL. I’ve been pleased to see the evolution of the database and have actively embraced MariaDB in deployments, particularly within AWS cloud environments, while continuing to utilize MySQL in other contexts."
    },
    {
      "name": "Windows Office Administrator",
      "years": "~2 (Aggregate from ISP Painting and CellTrak)",
      "type": "Administrative Support / IT",
      "level": "Intermediate",
      "details": "I received comprehensive training in Windows Officeancen administration during my time at ISP Painting and later applied those skills at CellTrak, stepping in to provide support following a consultant's departure. While office technologies have evolved, I am capable of quickly adapting and providing functional administrative support when needed, though this isn’t a skill I actively maintain."
    },
    {
      "name": "System Administration",
      "type": "DevOps / Infrastructure",
      "level": "Expert",
      "years": "15+",
      "details": "I have consistently practiced system administration throughout my career, from managing co-located servers to overseeing cloud-based infrastructure. This experience provides me with a strong understanding of underlying system packages, containerization principles, and the intricacies of building, optimizing, and updating Docker containers for deployment in Kubernetes environments."
    },
    {
      "name": "Custom Framework",
      "type": "Software Development / Architecture",
      "level": "Expert",
      "years": "~5 (aggregate)",
      "details": "Early in my career, particularly while working with PHP, I gained experience developing custom frameworks in situations where robust, established frameworks were unavailable. This involved implementing design principles and patterns that were later validated and refined by industry-standard frameworks. This experience provides me with a deep understanding of framework architecture, data flow, and the underlying mechanisms that deliver content to the internet."
    },
    {
      "name": "VMWare",
      "type": "Infrastructure / Virtualization",
      "level": "Intermediate",
      "years": "~4 (early cloud adoption & cost optimization)",
      "details": "I received intensive VMWare training while working at companies that were early adopters of cloud computing and virtualization technologies. This focused on leveraging VMWare to reduce costs and optimize infrastructure, particularly transforming existing hardware into virtualized environments. While I’ve since transitioned to AWS, Azure, and GCP, I gained significant experience with VMWare during my time at ISP Painting and iCrossing."
    },
    {
      "name": "TDD",
      "level": "Expert / Advocate",
      "years": "8+ (consistent practice & team leadership)",
      "type": "Software Development / Quality Assurance",
      "details": "I am a strong advocate for Test-Driven Development (TDD) and believe it should be central to the software development process. As a team manager at CellTrak, I successfully implemented a culture of TDD, resulting in a significant reduction in production errors and a streamlined QA cycle, even in challenging resource environments."
    },
    {
      "name": "Zendesk",
      "type": "Ticketing System",
      "level": "Novice",
      "years": "< 1",
      "details": "I primarily focused on adding and managing plugins for Zendesk, which was utilized as an internal ticketing system. Although it’s been some time since I’ve actively used it, I’m aware of its significant maturation and improved feature set."
    },
    {
      "name": "Heroku",
      "type": "Cloud Platform / DevOps",
      "level": "Expert",
      "years": "3+",
      "details": "While at iCrossing, I utilized Heroku extensively to facilitate rapid prototyping and deployment of proof-of-concept projects. This cost-effective platform allowed us to quickly showcase working applications to clients and stakeholders, enabling faster feedback loops and bringing innovative ideas to life that might otherwise have remained undeveloped. I still leverage Heroku for personal projects and helping people start up their own businesses."
    },
    {
      "name": "CentOS",
      "type": "Infrastructure / System Administration",
      "level": "Expert",
      "years": "8+",
      "details": "I used from the time I was ISP Painting to my first role at CellTrak. I would often be one of the stand-alone linux users at a company and maintain my own endpoint as well as be a back up devops contact for unusual situations. I know my way around Bash and z-shell and even tinkered with and contributed to Fedora. But I have worked with several flavors of linux, CentOS was the longest, though."
    },
    {
      "name": "Fedora",
      "type": "Linux Operating System",
      "level": "Expert",
      "years": "3+",
      "details": "I used Fedora as my main operating system at iCrossing, where I had the freedom to make decisions about my personal computer's configuration. This autonomy empowered me to work exactly how I wanted and kept me close to the OS running our web servers. A notable highlight of my experience is a bug‑fix contribution to Fedora’s time‑zone calculation routine—a small but proud claim to fame."
    },
    {
      "name": "Jenkins",
      "type": "CI/CD Automation Tool",
      "level": "Expert",
      "years": "10+",
      "details": "I have become a power user of Jenkins through the varied and veracious work at CellTrak. I have leveraged it to improve development cycles, build CI/CD pipelines, enhance monitoring, ship internal tools, deploy AWS Lambdas, and launch services both synchronously and asynchronously—managing resources and connections through secure channels. While Jenkins is fundamentally a job runner, its well‑thought‑out and flexible architecture enabled us to streamline massive automation and simplify very complex tasks."
    },
    {
      "name": "Apache",
      "type": "Web Server / Infrastructure / DevOps",
      "level": "Intermediate",
      "years": "15+",
      "details": "I know my way around Apache, though I wouldn't call myself an expert because there is still a lot to learn. I can easily maintain and configure an Apache server, almost by heart at this point. I have delivered many web servers personally, privately, and professionally using my knowledge of Apache and its configuration. This experience is highly transferable, as other web servers rely on the same principles of Apache, simply tweaked or paired with different languages or tailored for different circumstances."
    },
    {
      "name": "Postgres",
      "type": "Relational Database Management System (RDBMS)",
      "level": "Intermediate",
      "years": "10+",
      "details": "I have been using PostgreSQL since my time at iCrossing. I value its strong community, especially the Python community, which has helped it gain surprising popularity despite not being as feature‑rich or as fast as some other databases. This community support has made deployment easy, and PostgreSQL is often the go‑to database for many Platform‑as‑a‑Service web companies. My foundational understanding of MySQL further helps me recognize PostgreSQL’s pitfalls and benefits."
    },
    {
      "name": "Groovy",
      "type": "Programming Language",
      "level": "Novice",
      "years": "~1",
      "details": "I have only had to troubleshoot with Groovy and set up projects that combine Maven and Groovy. While I’ve barely used the language directly, this exposure gives me a surface‑level understanding of its syntax and typical build‑script scenarios. I would be the Ruby developer collaborating with  teammates who specializes in Groovy."
    },
    {
      "name": "Maven",
      "type": "Build Automation Tool",
      "level": "Novice",
      "years": "< 1",
      "details": "I know how to run Maven and compile Java projects with it. I haven’t used it extensively, but I understand its value in managing precompiled code and dependency resolution."
    },
    {
      "name": "Ruby on Rails",
      "type": "Web Application Framework",
      "level": "Expert (a little rusty)",
      "years": "4+ (Professionally and personally)",
      "details": "I loved working in Ruby on Rails—the vibrant community and the mindset of convention over configuration made every day a pleasure. The fact that the framework is built on Ruby itself added to the enjoyment. I used Rails heavily day‑in and day‑out during my time at iCrossing and Springleaf, and continued to build personal projects with it for many years afterward, though that was the end of my professional Rails experience.<br><br>My proudest accomplishment came at Springleaf: I meta‑programmed an event‑driven, idempotent emailing service that automatically generated a base set of tests and checks for hard‑to‑identify program choices. The design made subclass creation straightforward, which enabled us to transform a project that would have taken 18 months with the previous setup into a fully extensible, easy‑to‑learn service completed in just 3 months. The service incorporated numerous safeguards against spamming or sending unnecessary email communications, drastically improving both speed and quality."
    },
    {
      "name": "Ruby",
      "type": "Programming Language",
      "level": "Expert",
      "years": "8+",
      "details": "I use Ruby as often as possible when creating scripts and quick one‑off projects. I employed it heavily at iCrossing and Springleaf alongside Rails and would happily jump at a chance to work with it again. Ruby is a language that feels built with the developer in mind—its expressiveness and developer‑friendly syntax make it a joy to use. While it isn’t as “fast” as some other languages and its rapid rise to popularity has attracted its share of critics, it remains a wonderful language for automating tasks on my machine or writing scripts that I don’t expect others to maintain."
    },
    {
      "name": "Git",
      "type": "Version Control System",
      "level": "Expert",
      "years": "14",
      "details": "I have always viewed version control as a fundamental skill for any collaborative code or project work. Git blew me away with its ease of use and clarity of control compared to early version control systems, making it the de‑facto standard. I am frequently regarded as the Git expert wherever I have worked: I routinely untangle complex merge conflicts, recover deleted work, and resolve bugs that arise when others merge over each other’s changes."
    },
    {
      "name": "GitLab",
      "type": "DevOps / Repository Management",
      "level": "Intermediate",
      "years": "~4 (professional experience at iCrossign and ActiveCampaign)",
      "details": "GitLab has consistently appeared throughout my career, offering controls over repositories that GitHub doesn’t provide—webhooks, automation, commit hooks, and a growing suite of features. While working at iCrossing, I helped a team install and run GitLab internally, advocating best‑practice deployment to the DevOps group. Later at ActiveCampaign, I addressed and fixed several bugs as the organization adopted GitLab. I understand the tradeoffs of hosting GitLab in‑house versus paying for external services, and I know how to run Git servers independently and deploy GitLab to support those environments. I appreciate all the additional controls and plugins that come with GitLab and use it to enhance repository governance."
    },
    {
      "name": "CoffeeScript",
      "type": "Programming Language (JavaScript Superset)",
      "level": "Expert",
      "years": "< 3",
      "details": "I used CoffeeScript heavily at iCrossing, turning vanilla JavaScript into OOP‑driven custom frameworks with ease. Its syntax is close to Ruby, which made it natural to pair with my everyday work in Ruby on Rails. Today, with the advancements in ES6, I consider CoffeeScript largely obsolete."
    },
    {
      "name": "Agile",
      "type": "Development Methodology",
      "level": "Expert",
      "years": "20+",
      "details": "I am a strong advocate for Agile, always balancing time, speed, and quality. After attending multiple conferences and reading numerous books on the topic, I apply Agile principles with a focus on clarity rather than buzzwords. I emphasize the bottleneck of limited developers against feature count and critique companies that push developers into long hours and risky decisions. Agile de‑escalates the process, openly communicating project capabilities and uncertainties. In practice, stakeholders—customers, clients, managers, and teammates—appreciate the transparency and effectiveness that Agile brings to project delivery."
    },
    {
      "name": "Rubocop",
      "type": "Ruby Static Analysis Tool",
      "level": "Intermediate",
      "years": "2-4",
      "details": "RuboCop is a popular tool in the Ruby on Rails ecosystem for enforcing coding style, catching anti‑patterns, and ensuring consistency. I have used it regularly in development and test environments to maintain high‑quality code, integrating it into CI pipelines and project workflows."
    },
    {
      "name": "Kane",
      "type": "Complexity Analysis Tool",
      "level": "Intermediate",
      "years": "2-4",
      "details": "Kane is a lightweight Ruby gem that was popular in the Rails ecosystem during my time at iCrossing and Springleaf. It helps developers assess and manage code complexity by evaluating cyclomatic complexity, nesting depth, and other maintainability metrics. I used it for quick, cursory checks to keep our codebases from becoming overly complex, but it is not a full‑blown testing framework—rather a handy sanity tool for keeping complexity in check."
    },
    {
      "name": "Jira",
      "type": "Project Management & Issue Tracking Platform",
      "level": "Expert",
      "years": "15+",
      "details": "I have used Jira professionally and personally since its early adoption at iCrossing. It remains the primary project‑management tool across all my positions, surpassing alternatives in flexibility and feature richness. I have served as a Jira administrator, setting up new projects, configuring custom workflows, and creating numerous dashboards. My extensive experience also includes deep engagement with Jira APIs, where I built automated triggers that perform actions on tickets and transition them to completion."
    },
    {
      "name": "SCSS",
      "type": "CSS Preprocessor",
      "level": "Expert",
      "years": "15+",
      "details": "I really like using SCSS and incorporate it into almost every project I work on. Its features—variables, nesting, mixins, and partials—make it straightforward to integrate into existing build pipelines and dramatically improve the organization and readability of CSS. By leveraging SCSS, I create modular, reusable styles that reduce duplication, speed up development, and simplify maintenance across multiple teams and projects."
    },
    {
      "name": "Sinatra",
      "type": "Ruby Web Framework",
      "level": "Intermediate",
      "years": "< 2",
      "details": "I was exposed to and used Sinatra during my time at Ruby. I found myself using it more for quick POCs for myself or in meetings. It’s a lightweight, DSL‑based web framework that shares many design concepts with FastAPI (Python) and feels closer to Streamlit’s simplicity. While I haven’t used Sinatra extensively, I can quickly reacquaint myself with its routing, middleware, and template handling if a lean server is needed in any language I’m working with."
    },
    {
      "name": "Ember",
      "type": "JavaScript Web Framework",
      "level": "Beginner",
      "years": "< 1",
      "details": "I’ve used Ember in a few projects while doing backend work, and I’ve completed several training courses that gave me a solid grasp of its core concepts—routing, components, services, and Ember CLI tooling. Although I haven’t executed extensive development with Ember, I’m comfortable navigating its structure and can quickly ramp back up if the project requires a lean, convention‑driven front‑end stack."
    },
    {
      "name": "Backbone",
      "type": "JavaScript MVC Library",
      "level": "Intermediate",
      "years": "1+",
      "details": "I’m comfortable with Backbone, having built several features during a quick proof‑of‑concept at iCrossing. I handled routing, models, collections, and views to deliver functional components and maintained the project smoothly, demonstrating a solid grasp of Backbone’s architecture and best practices."
    },
    {
      "name": "D3.js",
      "type": "JavaScript Visualization Library",
      "level": "Expert",
      "years": "2+",
      "details": "I have a strong passion for visual data engineering—D3.js is my go‑to tool for turning large, complex data sets into interactive, responsive visualizations. Although it has a steep learning curve, its powerful binding and transformation capabilities make it one of the most versatile libraries I’ve worked with. I routinely recommend D3.js to my direct reports and colleagues for any project requiring detailed diagrams, maps, or intricate data interactions. In a multi‑year Hearst project at iCrossing, I helped visualize user traffic using gravity, weights, and filters to reveal user communities and interest alignment across enterprises, drawing directly from our data lake. The work was rewarding, uncovering insights that were otherwise hidden in raw data."
    },
    {
      "name": "Meta Programming",
      "type": "Advanced Programming Technique",
      "level": "Expert",
      "years": "(as needed)",
      "details": "Meta‑programming in Ruby and PHP is all about writing code that writes code. I’ve applied this skill in two high‑impact scenarios:<br/><br/><b>SpringLeaf – Ruby on Rails Email Service Framework</b> – I built a superclass that understood the email service architecture, its safety requirements, and idempotent design. Sub‑classes automatically generated comprehensive test suites (commit‑ready with a single command), while the framework enforced Rails conventions, provided detailed documentation, and surfaced warnings or errors. The result was a superset service that turned minimal input into a fully‑featured, test‑ready component.<br/><br/><b>CellTrak – PHP/Symfony IVR DSL</b> – While developing an IVR system in PHP with Symfony, I created a lightweight domain‑specific language that let project managers describe phone interactions—from menu navigation to background callbacks—in natural, declarative syntax. The DSL handled data collection, audio file references, and interaction logic, enabling developers to focus on testing rather than plumbing code. This required harnessing PHP’s ReflectionClass, __call, and Symfony’s Compiler Passes to inject generated code into the service container at compile time.<br/><br/>These projects demonstrate my ability to leverage language‑specific metaprogramming features to deliver clean, reusable, and fully‑tested code generators that adapt to the needs of a given codebase."
    },
    {
      "name": "Mentoring",
      "type": "Leadership / Professional Development",
      "level": "Expert",
      "years": "15+",
      "details": "I enjoy helping others discover their passion for coding. I’ve served as a mentor in several roles, most notably at CellTrak, where my team functioned as an onboarding springboard for new hires. These individuals would spend one to six months with us, learning the skills and cultural norms needed to succeed before joining their dedicated teams. As a software engineering manager at CellTrak, I led a team of four junior developers and one senior developer, consistently challenging them to step outside their comfort zones and achieve significant milestones. I continue to receive feedback from former team members who express difficulty finding managers who prioritize their professional development to the same extent. While flattered by their recognition of my impact, I’m more disheartened that they aren’t receiving the support they deserve elsewhere. I believe in fostering growth within teams—both offering and seeking mentorship opportunities."
    },
    {
      "name": "Microservices",
      "type": "Software Architecture",
      "level": "Expert",
      "years": "10+",
      "details": "I have extensive experience designing, building, and maintaining microservice systems, dating back to my time at Springleaf. Most recently, I've been focused on building Retrieval-Augmented Generation (RAG) systems from the ground up using Google Cloud Platform (GCP). These systems represent the ultimate expression of microservice architecture, comprising modular applications that can seamlessly integrate various Large Language Models (LLMs) and data sources. For example, the sales team can use a RAG system to conduct market research by leveraging Gemini against a sales knowledge base, with outputs adaptable for file generation or chatbot responses. Similarly, the project management team can pull information from the internal wiki to develop strategic plans and automatically generate work tickets within their project management platform. The ability to swap data sources, LLMs, and output formats demonstrates the power of this architecture to create flexible, scalable, and easily upgradable solutions."
    },
    {
      "name": "Redis",
      "type": "In-Memory Data Store",
      "level": "Expert",
      "years": "10+",
      "details": "I’ve used Redis extensively to improve the responsiveness of applications and provide caching across pods and microservices, enhancing performance and scalability."
    },
    {
      "name": "Sidekiq",
      "type": "Background Job Processor",
      "level": "Expert",
      "years": "4+",
      "details": "I’ve utilized Sidekiq as a lightweight and reliable event queue within Ruby on Rails projects, offloading time-consuming tasks and improving application responsiveness."
    },
    {
      "name": "Jest",
      "type": "JavaScript Testing Framework",
      "level": "Expert",
      "years": "7+",
      "details": " I’ve used Jest extensively with React projects, appreciating its comprehensive features—including built-in reporting and a wide range of testing capabilities. I’m very comfortable with the framework and find its easy-to-write syntax encourages and facilitates Test-Driven Development (TDD)."
    },
    {
      "name": "PHPUnit",
      "type": "PHP Testing Framework",
      "level": "Expert",
      "years": "10+",
      "details": "I have substantial experience with PHPUnit, utilizing it both within established frameworks like Symfony and Laravel, and in completely custom projects at ActiveCampaign and CellTrak. This has included creating custom configurations and data loaders to ensure proper test execution. Recognizing that PHPUnit can be resource-intensive, I’ve also implemented parallel CI/CD pipelines within GitLab to significantly reduce testing times for development branches."
    },
    {
      "name": "Kubernetes",
      "type": "Container Orchestration Platform",
      "level": "Intermediate",
      "years": "6+",
      "details": "I’ve led development efforts to establish Kubernetes environments and utilize Minikube for local development cycles. I’ve also created Helm charts to streamline deployments for DevOps teams. While I possess a strong theoretical understanding of Kubernetes deployment and configuration, I’ve typically relied on a dedicated DevOps team to finalize the production deployment process within Terraform. I view this as the final gap in my skill set and plan to address it through further training in the near future."
    },
    {
      "name": "GitHub",
      "type": "Online Respository Platform",
      "level": "Expert",
      "years": "12+",
      "details": "GitHub is a robust and constantly evolving platform with a comprehensive set of features. I’ve leveraged its webhooks, administration features, and plugins extensively, and have overseen the operation of several smaller enterprises utilizing the platform. While I have preferences for other repository platforms due to minor usability quirks, I readily recommend GitHub as a reliable and widely adopted solution for version control and collaboration."
    },
    {
      "name": "SQS",
      "type": "Message Queue Service",
      "level": "Expert",
      "years": "8+",
      "details": "I have extensive experience architecting systems around Amazon SQS, encompassing everything from standalone applications performing asynchronous tasks to complex messaging platforms supporting numerous microservices and applications. I’m comfortable implementing SQS and its related APIs to maximize responsiveness and maintain up-to-date information across disparate entities, including integrating it with Lambda functions and Amazon EventBridge events."
    },
    {
      "name": "NPM",
      "type": "Package Manager",
      "level": "Expert",
      "years": "15+",
      "details": "I have been utilizing NPM since its early releases, with experience creating and publishing professional-grade packages, leveraging its private deployment system for managing organization-wide libraries, and employing it for general package management and project-level scripting."
    },
    {
      "name": "Node.js",
      "type": "JavaScript Runtime Environment",
      "level": "Expert",
      "years": "15+",
      "details": "I was an early adopter of Node.js, immediately drawn to its asynchronous capabilities and rapid development cycle. I’ve implemented numerous personal projects, proof-of-concepts, and team-specific solutions using Node. I appreciate its expansion into a full-stack, multi-platform development environment. While the platform continues to evolve at a rapid pace, I am highly proficient with Node.js and eager to apply my expertise to new challenges."
    },
    {
      "name": "Docker",
      "type": "Containerization Platform",
      "level": "Expert",
      "years": "10+",
      "details": "I began using Docker in its early stages at iCrossing, initially finding it buggy and lacking the features of established virtualization platforms like VMWare and Vagrant. However, after witnessing significant improvements and the emergence of new capabilities, I adopted it for personal projects and quickly recognized the power of containerization. I championed its implementation at ActiveCampaign and CellTrak, leveraging proof-of-concepts and the growing momentum around Kubernetes to successfully transition development teams from Vagrant to Docker. I’ve never looked back, and I’m now a strong advocate for Docker’s “code as configuration” approach, enabling rapid, repeatable system administration and eliminating the need for managing a library of tiny scripts to ensure consistent environments for the development team."
    },
    {
      "name": "Kafka",
      "type": "Novice",
      "level": "",
      "years": "1+",
      "details": "I have experience building a number of Proof-of-Concept implementations of Kafka. At ActiveCampaign were even aided by a team of AWS consultants to facilitate integration with existing systems. While recognizing its power and scalability, most integrations have been halted because the complexity and associated costs often outweigh the benefits for many development teams, where simpler solutions like SQS are sufficient. I have also explored alternative streaming platforms such as Kinesis to evaluate viability for specific use cases."
    },
    {
      "name": "JSOND",
      "type": "Data Format",
      "level": "Expert",
      "years": "~1",
      "details": "JSOND is a departure from traditional data formats like JSON, CSV, and XML, designed to facilitate structured streaming data flows. While not widely known, it offers significant advantages in specific scenarios and can be a game-changer when applied appropriately."
    },
    {
      "name": "Custom Frameworks",
      "type": "Software Architecture",
      "level": "Expert",
      "years": "~4",
      "details": "My experience building custom frameworks, mostly in PHP, from a low level provides a deep understanding of the underlying needs, drawbacks, and advantages inherent in modern frameworks. This foundational knowledge enhances my appreciation and effective utilization of established frameworks."
    },
    {
      "name": "Leadership",
      "type": "Management / Team Leadership",
      "level": "Expert",
      "years": "10+",
      "details": "Throughout my career, I've been entrusted with leadership roles in various capacities. Beginning with project leadership at CellTrak, I quickly demonstrated an ability to organize teams and ensure on-time delivery. This evolved into management positions at both CellTrak and ActiveCampaign, where I successfully led teams with diverse personalities and skill levels. As Software Engineering Manager, I was responsible for the full employee lifecycle – interviewing, project management, performance management, personal development planning, budget oversight, career growth, and mentorship – fostering a high-performing team of passionate individuals. I've consistently received positive feedback on my leadership style, with team members actively requesting to join my teams. Furthermore, upper management frequently entrusts me with critical projects and significant decision-making autonomy, consistently resulting in successful outcomes."
    },
    {
      "name": "Desktop Deployment",
      "type": "Software release / System Administration",
      "level": "Expert",
      "years": "4",
      "details": "Desktop application deployment presents unique challenges beyond standard software release procedures. This includes securing appropriate licensing and code signing for Windows, navigating the app store submission and approval process, and establishing automated update mechanisms through platforms like GitHub. Successfully managing this process requires ongoing adaptation to OS updates and evolving security/permission requirements. While streamlined, less secure deployment methods are possible, I prioritize a full-fledged, robust approach to ensure reliable and secure updates for end-users."
    },
    {
      "name": "EC2",
      "type": "Cloud Computing / System Administration",
      "level": "Expert",
      "years": "10+",
      "details": "Leveraging my system administration expertise, I can rapidly provision EC2 instances and associated resources within AWS to facilitate Proof-of-Concept development. At CellTrak, I utilized this skill to initiate the creation of a CI pipeline during our platform migration to cloud storage. While the DevOps team ultimately expanded on this work, I also contributed to a Kubernetes-adjacent deployment strategy for our legacy applications on the platform team. This approach offers cost savings and accelerated environment validation, though it requires careful consideration regarding security and governance."
    },
    {
      "name": "AWS",
      "type": "Cloud Platform",
      "level": "intermediate",
      "years": "15+",
      "details": " I have a solid foundation in AWS, having integrated various AWS services into projects since my time at iCrossing. While I’ve had the opportunity to work on teams fully dedicated to AWS for short periods, my AWS integration work has primarily been conducted with the support of dedicated DevOps teams."
    },
    {
      "name": "Vagrant",
      "type": "Virtual Development Environment",
      "level": "Expert (irrelevant)",
      "years": "~9",
      "details": "I have experience with Vagrant from its early adoption as a tool for standardizing development environments. However, with the prevalence of Docker and Kubernetes, its practical application in current projects is limited."
    },
    {
      "name": "Electron",
      "type": "Cross-Platform Desktop Application Framework",
      "level": "Expert",
      "years": "7+",
      "details": " I have extensive experience developing cross-platform desktop applications using Electron, and have led teams utilizing it for shared applications, Proof-of-Concept development, and accelerating web-based application creation with frameworks like React and Svelte. It’s a valuable tool for quickly bypassing DevOps overhead when needed. While not without its quirks, I’m familiar with its challenges and can leverage its strengths to deliver effective solutions."
    },
    {
      "name": "React",
      "type": "JavaScript Framework",
      "level": "Expert",
      "years": "13+",
      "details": "I have maintained proficiency with React since its release in 2013, consistently keeping my skills sharp as it has become a prevalent technology. My most intensive experience includes building a full-fledged Electron-based desktop application using React as its core framework. I am proficient in Test-Driven Development (TDD) with React, and comfortable establishing new projects with Redux."
    },
    {
      "name": "Redux",
      "type": "State Management Library",
      "level": "Expert",
      "years": "4+",
      "details": "I am proficient in using Redux for predictable state management in JavaScript applications. I have experience integrating Redux with React projects, implementing reducers, actions, and middleware to manage complex application data flows. I'm comfortable setting up new Redux stores and scaling existing implementations."
    },
    {
      "name": "Symfony",
      "type": "PHP Framework",
      "level": "Expert",
      "years": "~10",
      "details": "I have extensive experience with Symfony, utilizing its versatility throughout my time at CellTrak. I am comfortable setting up, running, and maintaining Symfony projects, with a strong understanding of its advanced features including the event and listener system for asynchronous processing, robust security components, dependency injection layer, and reusable services and components."
    },
    {
      "name": "Project Management",
      "type": "Leadership / Planning / Communication",
      "level": "Expert",
      "years": "5+",
      "details": "In addition to my role as Engineering Manager, I have frequently assumed project management responsibilities when dedicated resources were unavailable. This includes collaborating with upper management to align projects with customer and product goals, developing comprehensive plans encompassing architecture, pricing, and feature rollout timelines, and presenting this information to stakeholders. I’m experienced in creating demonstration materials and providing regular progress updates, effectively wearing multiple hats to ensure successful project delivery."
    },
    {
      "name": "Datadog",
      "type": "Monitoring & Observability Platform",
      "level": "Expert",
      "years": "~10",
      "details": "I have been a dedicated user of Datadog for over 10 years, witnessing its evolution from early feature development to a comprehensive observability solution. I was involved in the initial implementation and configuration of Datadog for PHP and EC2 monitoring, collaborating directly with Datadog engineers during platform expansion. I played a key role in establishing centralized log management for both legacy and new microservice architectures across CellTrak and ActiveCampaign, overcoming challenges posed by varied business decisions over time. I contributed to the research, setup, and tailoring of initial monitoring agents, and championed the adoption of synthetic monitoring as a standard for new development endpoints and applications. Additionally, I assisted in the creation of custom alerts and alert equilibrium, working with DevOps and development teams to ensure timely notifications of critical issues while minimizing alert fatigue."
    },
    {
      "name": "Chef",
      "type": "Configuration Management Tool",
      "level": "Intermediate",
      "years": "<1",
      "details": "I invested significant effort in learning and implementing Chef at CellTrak, building a Proof-of-Concept to evaluate its potential benefits. Leveraging my understanding of traditional infrastructure platforms, I developed a containerized deployment recipe for Chef. While the organization ultimately decided against adopting Chef due to licensing costs and required adjustments, the insights gained from this POC directly informed the evolution of our existing Jenkins pipelines and the integration of Ansible, enabling asynchronous task execution and the creation of server images for rapid deployment in AWS."
    },
    {
      "name": "Ansible",
      "type": "Configuration Management Tool",
      "level": "Beginner",
      "years": "<1",
      "details": "I have experience working alongside DevOps teams utilizing Ansible for configuration management, application deployment, and automation. While I’ve contributed to the creation of configuration files, my primary exposure has been leveraging the work of dedicated Ansible engineers and benefiting from its capabilities within a broader DevOps workflow. It is something that I'm curious to learn more about in the future."
    },
    {
      "name": "Helm",
      "type": "Kubernetes Package Manager",
      "level": "Intermediate",
      "years": "~5 (but sparsely)",
      "details": "I have experience working alongside DevOps teams utilizing Ansible for configuration management, application deployment, and automation. While I’ve contributed to the creation of configuration files, my primary exposure has been leveraging the work of dedicated Ansible engineers and benefiting from its capabilities within a broader DevOps workflow."
    },
    {
      "name": "Concierge",
      "type": "Automation & Remediation tool",
      "level": "Expert",
      "years": "6+",
      "details": " I was a key contributor to the development and evolution of Concierge, an in-house automation and remediation tool built at CellTrak. Initially designed to enable remote troubleshooting and hotfix deployment for the Tier 3 technical support team, Concierge evolved into a sophisticated system capable of autonomously resolving issues identified through Jira tickets. I proposed and implemented the integration with our existing Jira ticket processing library, enabling Concierge to automatically detect, diagnose, and resolve known issues. This involved overcoming significant technical challenges in ensuring data integrity and preventing unintended consequences when interacting with diverse systems. Later development phases involved migrating Concierge to a serverless architecture utilizing AWS Lambdas, EventBridge, and CloudWatch, enabling real-time error detection and remediation. Concierge was written in Python and deployed as a self-updating agent. This system predated widespread AI adoption, effectively achieving automated problem resolution at scale."
    },
    {
      "name": "Transparency",
      "type": "Leadership / Communication / Interpersonal Skills",
      "level": "Expert",
      "years": "6+",
      "details": "Transparency is a core principle of my management style, built on the belief that sound decision-making and a healthy team environment require open and honest communication. I prioritize fostering a culture where team members feel comfortable voicing concerns and sharing feedback, even on difficult topics. This approach, rooted in mutual respect, has consistently resulted in more candid conversations regarding working conditions and individual challenges, allowing for proactive support rather than reactive intervention. I also understand the importance of balancing transparency with the need to maintain confidentiality and uphold company integrity, particularly when communicating unfavorable decisions."
    },
    {
      "name": "Management",
      "type": "Leadership / Mentorship / Team Building",
      "level": "Expert",
      "years": "8+",
      "details": "While initially hesitant due to my introverted nature and passion for coding, I have found management to be a deeply rewarding experience. I particularly enjoy mentoring team members, leveraging my strong foundation in coding and architecture to foster a culture of collaboration and experimentation with new technologies and paradigms. Driven by a desire to be the type of manager I would have thrived under, I excel at maintaining both micro and macro level goals, facilitating thoughtful discussions around architecture strategies, and empowering my team to achieve success. Despite the inherent challenges, the positive impact on team growth and project outcomes makes the effort worthwhile."
    },
    {
      "name": "Informer",
      "type": "Incident Communication and Escalation Tool",
      "level": "Expert",
      "years": "5",
      "details": "I was a key contributor to the development of Informer, an in-house incident communication and escalation tool built at CellTrak. Designed to complement and enhance the capabilities of Concierge, Informer automated the process of alerting the appropriate personnel and coordinating response efforts in the event of priority one issues or service disruptions. The system implemented a tiered escalation process, beginning with automated Teams chat invitations for on-call support personnel, progressing to direct messaging and phone calls if no response was received, and ultimately involving management intervention. Informer also automated the creation of external communication templates, centralized customer reporting via Jira tickets, and provided real-time status updates to relevant channels. Like Concierge, Informer was integral to the success of our technical support teams and significantly improved incident resolution times. (The application’s evoked memories of that 90's song of the same title.)"
    },
    {
      "name": "Wiz",
      "type": "Cloud Security / Vulnerability Management Tool",
      "level": "Novice",
      "years": "2",
      "details": "I have experience utilizing Wiz, a cloud security platform, to identify security vulnerabilities, including configuration faults, malicious activity, and known issues within software dependencies. While I haven't deeply explored the full capabilities of the tool, I have leveraged it on an as-needed basis to address security concerns, appreciating its ability to surface critical issues efficiently."
    },
    {
      "name": "Terraform",
      "type": "DevOps / Infrastructure Automation",
      "level": "Intermediate",
      "years": "5+",
      "details": "I have experience contributing to the setup and configuration of Terraform, an Infrastructure as Code (IaC) tool. I’ve written Terraform configurations to automate infrastructure provisioning, but my involvement has been primarily focused on contributing to broader team efforts rather than deep, independent development. I am eager to expand my expertise in Terraform and actively seek opportunities to gain greater familiarity with the tool, while recognizing that dedicated teams will likely remain the primary experts in this area."
    },
    {
      "name": "FastAPI",
      "type": "Backend Development / API Design",
      "level": "Expert",
      "years": "7+",
      "details": "I am an expert in developing APIs using FastAPI, a modern, high-performance Python framework. I have extensive experience with various Python API libraries, but I consistently choose FastAPI for its self-documenting capabilities, lightweight design, and focus on delivering efficient APIs. I have successfully deployed countless production-quality APIs, POCs, and lightweight development projects utilizing FastAPI, and appreciate its seamless integration with other frameworks like Streamlit for expanding application functionality."
    },
    {
      "name": "Blob Storage",
      "type": "Cloud Storage / Data Management",
      "level": "Expert",
      "years": "2+",
      "details": "I have extensive experience utilizing Google Cloud Blob Storage (akin to AWS S3) for storing large files. Over the past two years, my usage has significantly increased in conjunction with the development of Retrieval Augmented Generation (RAG) systems, facilitated by the seamless integration with Google Vertex AI and the prevalence of Google Workspace data sources such as wikis and documents. I am comfortable accessing and managing blob storage at scale through both the command-line interface and API. While not a complex technology, I have a strong understanding of best practices for its effective utilization."
    },
    {
      "name": "Communication Skills",
      "type": "Soft Skills / Interpersonal Communication",
      "level": "Expert",
      "years": "15+",
      "details": "Based on consistent positive feedback, I excel at communicating complex technical concepts to both technical and non-technical audiences, tailoring the depth and brevity of my explanations to their specific interests and needs. I am also known for being thoughtful and considerate of colleagues’ professional and personal well-being, consistently going the extra mile to ensure understanding and inclusivity. I understand the importance of discerning when to provide detailed explanations and when to prioritize clarity and conciseness, recognizing that effective communication requires knowing when to elaborate and when to maintain a high-level overview."
    },
    {
      "name": "Pinecone",
      "type": "Vector Database / AI Infrastructure",
      "level": "Intermediate",
      "years": "2+",
      "details": "I have recently been introduced to and am actively utilizing Pinecone, a vector database, primarily within the context of Retrieval Augmented Generation (RAG) systems where AI directly interacts with the database. While I am comfortable using Pinecone in these applications, I recognize the potential for optimization at scale and am actively learning on the job to expand my expertise in this area as I build increasingly complex systems utilizing AI orchestration."
    },
    {
      "name": "ChromaDB",
      "type": "Data Management / AI Infrastructure",
      "level": "Intermediate",
      "years": "2+",
      "details": "I am comfortable utilizing ChromaDB, a vector database particularly well-suited for development and smaller-scale projects. While I have experience with the tool, I haven’t extensively explored its advanced features due to the limited number of use cases."
    },
    {
      "name": "Vitest",
      "type": "Testing Framework",
      "level": "Expert",
      "years": "4+",
      "details": "I am proficient in utilizing Vitest, a JavaScript testing framework designed to work seamlessly with Vite. I am a strong advocate of Test-Driven Development (TDD) and appreciate Vitest’s ease of use, which promotes consistent and reliable testing practices. I have found that Vitest significantly contributes to the stability of the Svelte applications I have developed."
    },
    {
      "name": "Playwright",
      "type": "Testing Framework / End-to-End Testing",
      "level": "Expert",
      "years": "4+",
      "details": "I am proficient in utilizing Playwright, an end-to-end (E2E) testing framework. I value its simplicity and ease of interaction, which supports a robust testing strategy and contributes to the overall quality and stability of the applications I build, particularly within the Svelte ecosystem."
    },
    {
      "name": "TypeScript",
      "type": "Programming Language / Static Typing",
      "level": "Expert",
      "years": "3+",
      "details": "I have significant personal experience utilizing TypeScript, appreciating its benefits in terms of code maintainability and static typing. While my professional experience has primarily involved JavaScript development due to project requirements, I believe its concise syntax and logical structure would allow most developers to become proficient within 4-6 months."
    },
    {
      "name": "Salesforce",
      "type": "CRM / Platform Integration",
      "level": "Novice",
      "years": "~1 (aggregate)",
      "details": "I have experience developing Apex plug-ins and building automations for the Salesforce platform. While I haven’t utilized the core Salesforce application extensively, I possess a foundational understanding of its architecture and capabilities. I would require a brief refresher to quickly regain familiarity with specific features and functionalities."
    },
    {
      "name": "Gemini",
      "type": "Large Language Model",
      "level": "Expert",
      "years": "3+",
      "details": "In 2024, I participated in a charter at CellTrak to research and evaluate the strengths of various Large Language Models (LLMs), including Gemini, Chat-GPT, and Claude. We assessed their practical application to different business ideas and development scenarios. Ultimately, we selected Gemini for implementation due to the robust Vertex platform and the availability of pre-built, enterprise-level integrations offered by Google. Currently, at Bright Tech, I assist clients in selecting the optimal LLM based on factors such as scale, cost, and specific nuances among the available AI options."
    },
    {
      "name": "Chat-GPT",
      "type": "Large Language Model",
      "level": "Expert",
      "years": "3+",
      "details": "In 2024, I participated in a charter at CellTrak to research and evaluate the strengths of various Large Language Models (LLMs), including Gemini, Chat-GPT, and Claude. We assessed their practical application to different business ideas and development scenarios. Currently, at Bright Tech, I assist clients in selecting the optimal LLM based on factors such as scale, cost, and specific nuances among the available AI options."
    },
    {
      "name": "Claude",
      "type": "Large Language Model",
      "level": "Expert",
      "years": "3+",
      "details": "In 2024, I participated in a charter at CellTrak to research and evaluate the strengths of various Large Language Models (LLMs), including Gemini, Chat-GPT, and Claude. We assessed their practical application to different business ideas and development scenarios. Currently, at Bright Tech, I assist clients in selecting the optimal LLM based on factors such as scale, cost, and specific nuances among the available AI options."
    },
    {
      "name": "GCP",
      "type": "Cloud Computing",
      "level": "Intermediate",
      "years": "1+",
      "details": "While relatively new to the Google Cloud Platform (GCP), I possess a strong foundation in cloud computing principles developed through extensive experience with Amazon Web Services (AWS) at CellTrak. I’ve found a high degree of transferability between the two platforms, with GCP offering analogous services to those available in AWS. The primary exception is Gemini, which is a unique strength of the Google ecosystem."
    },
    {
      "name": "Vertex",
      "type": "Machine Learning Platform / AI Development",
      "level": "Expert",
      "years": "2+",
      "details": "Vertex AI has been essential to my recent research and development efforts in the field of AI. Its low-code environment and simplified dependency management have enabled rapid prototyping and the development of numerous Proof-of-Concepts (POCs). Vertex AI has proven valuable for both small-scale projects and enterprise-level integrations within the Google Cloud Platform, making it an ideal platform for exploring and validating AI initiatives."
    },
    {
      "name": "LangChain",
      "type": "LLM Orchestration Framework",
      "level": "Expert",
      "years": "2+",
      "details": "I have extensive experience utilizing LangChain to build and deploy complex AI-powered applications. This includes developing custom chains for specific business needs, integrating with vector databases like Pinecone and Chroma, and implementing various memory modules to enhance conversational AI experiences. I’ve also leveraged LangChain’s Agent capabilities to create autonomous systems with access to external tools and APIs. While LangChain provides a robust foundation, I've actively optimized components like embeddings and memory management to improve performance and reduce resource utilization, ensuring scalability for enterprise-level applications. I believe LangChain offers a highly effective environment for developers seeking to rapidly prototype and deploy sophisticated AI solutions."
    },
    {
      "name": "OpsGenie",
      "type": "Alert Management",
      "level": "Novice",
      "years": "1-3",
      "details": "I gained experience with OpsGenie during my time at CellTrak, utilizing it for on-call scheduling and incident management for my team. While I found its capabilities to be somewhat limited compared to our internally developed Informer application – particularly regarding escalation pathways tailored to specific service-derived teams and company needs – I am familiar with its core functionality and workflows."
    },
    {
      "name": "CloudWatch",
      "type": "Cloud Monitoring / Observability",
      "level": "Expert",
      "years": "8+",
      "details": "I have leveraged Amazon CloudWatch in virtually every capacity over the years, utilizing its full range of capabilities for monitoring, logging (including integration with Datadog), proactive incident prevention, major incident intervention, alerting, and automation through triggers like Lambda functions. I have a deep understanding of its features and have consistently applied them to optimize system performance and reliability."
    },
    {
      "name": "Lambda",
      "type": "Serverless Architecture",
      "level": "Expert",
      "years": "7+",
      "details": "I am proficient in developing and deploying AWS Lambda functions as part of microservice and serverless architectures. I understand the ideal use cases for Lambda and have experience building CI/CD pipelines to ensure continuous updates and maintainability. I've also contributed to the architectural design of Lambda functions, integrating them into both new and existing network and system configurations."
    },
    {
      "name": "EventBridge",
      "type": "Event-Driven Architecture / Integration",
      "level": "Expert",
      "years": "3+",
      "details": "I was quick to adopt Amazon EventBridge, recognizing its potential to significantly enhance our existing AWS-based architectures. Building upon our established use of CloudWatch for system monitoring, we rapidly integrated EventBridge to advance automation and proactively address system issues. A key transformation was migrating parallel processing tasks to Lambda functions triggered by real-time error events, enabling us to move from reactive troubleshooting to proactive issue resolution. This allowed us to address both long-term, complex problems and minor bugs efficiently, while also identifying and mitigating new errors introduced during deployments. EventBridge was instrumental in shifting our approach to system maintenance and significantly improving our operational efficiency."
    },
    {
      "name": "Svelte",
      "type": "JavaScript Framework",
      "level": "Expert",
      "years": "4+",
      "details": "Having been a long-time and proficient React developer, I initially approached the transition to Svelte with some skepticism. However, I quickly became a strong advocate for the framework, recognizing its significant advantages in streamlining development workflows. Svelte elegantly addresses many of my long-standing frustrations with React, particularly regarding routing, state management, and component complexity. I’ve found Svelte to be remarkably versatile and capable of delivering responsive, enterprise-level products with a focus on simplicity. As a result, I have proactively migrated both my personal and professional projects to Svelte, and I continue to be impressed by its ongoing evolution and commitment to developer experience."
    },
    {
      "name": "PyTorch",
      "type": "Machine Learning / Computer Vision",
      "level": "Beginner",
      "years": "<1",
      "details": "I am excited about the potential of PyTorch and have completed a certificate-level program to gain a foundational understanding of the framework. I have also applied computer vision techniques, utilizing PyTorch principles, at Bright Tech to train Retrieval-Augmented Generation (RAG) systems on PDF and scanned documents. While I haven’t yet had significant opportunities to directly develop in PyTorch professionally, I am actively exploring its capabilities and plan to focus on expanding my expertise in the coming year."
    },
    {
      "name": "Pydantic",
      "type": "Data Science / Python Library",
      "level": "Expert",
      "years": "7+",
      "details": "I have extensive experience utilizing Pydantic for data validation, settings management, and controlling data flows within my applications. I’ve found its capabilities particularly valuable in recent years for structuring the output of AI models, ensuring consistent and predictable responses."
    },
    {
      "name": "Pandas",
      "type": "Data Science / Python Library",
      "level": "Expert",
      "years": "7+",
      "details": "I have extensive experience utilizing Pandas for data cleaning, transformation, and preparation. Within the Concierge automation/support tool at CellTrak, Pandas was crucial for converting unstructured or corrupted data into a usable format, often in conjunction with Pydantic for data validation. I've also leveraged Pandas extensively in the data preparation phase for AI model training and building AI orchestration pipelines, recognizing its critical role in ensuring data quality and accuracy for production quality applications."
    },
    {
      "name": "Pytest",
      "type": "Pythong Testing Framework",
      "level": "Expert",
      "years": "5+",
      "details": "I have extensive experience utilizing Pytest for comprehensive software testing, particularly within API and microservice architectures. I highly value its mocking capabilities, which significantly reduce the need for complex development environments and allow developers to focus on testing specific components in isolation."
    },
    {
      "name": "FastMCP",
      "type": "MCP Framework",
      "level": "Intermediate",
      "years": "<1",
      "details": "I recently began utilizing FastMCP and have been impressed by its ease of implementation and potential for enhancing modularity and reusability within orchestration workflows. By acting as a decorator on existing skills, it allows for effortless component extraction and reuse across projects, future-proofing our development efforts. I’ve already found it valuable for accelerating testing and development cycles, enabling focused analysis of specific functionalities for bugs, hallucinations, or effectiveness, and strongly advocate for its adoption across all projects."
    },
    {
      "name": "Milvus",
      "type": "Vector Database",
      "level": "Expert?",
      "years": "<1",
      "details": "I have implemented Milvus as a vector database in systems requiring accurate phrase and passage recognition. I’ve observed its strengths compared to other databases when dealing with large datasets centered around specific phrases, rather than evolving queries. Coupling Milvus with Neo4J for tracking data relationships further enhances its performance. While I consider myself proficient in applying Milvus to solve practical problems, I haven’t extensively focused on low-level optimization, resulting in a hybrid skill level of expert application with intermediate optimization knowledge."
    },
    {
      "name": "Consulting",
      "type": "Professional Services / Communication",
      "level": "Expert",
      "years": "*",
      "details": "I possess strong technical knowledge, problem-solving skills, and communication abilities, allowing me to effectively transition between projects and deliver valuable solutions as a technical consultant. I enjoy identifying and resolving complex issues or implementing advanced features for organizations that may lack the internal expertise or resources. While I find consulting to be rewarding work, I prioritize long-term project engagement and the stability of a full-time employment arrangement."
    },
    {
      "name": "SLM",
      "type": "Machine Learning / AI Development",
      "level": "Intermediate",
      "years": "<1",
      "details": "I recognize the advantages of utilizing Small Language Models (SLMs) over Large Language Models (LLMs), including reduced cost, lower latency, enhanced privacy, and improved customization potential. I identify a significant barrier to SLM adoption as a lack of internal expertise and/or properly formatted data within most organizations. I anticipate increasing my focus on SLM development and implementation in the future."
    },
    {
      "name": "LLM",
      "type": "Machine Learning / AI Development",
      "level": "Beginner",
      "years": "<1",
      "details": "I possess a strong understanding of interacting with existing Large Language Models (LLMs) via APIs and tokenization, with experience utilizing platforms like OpenAI’s ChatGPT. I am currently building my expertise in the more complex process of training and deploying custom LLMs, having completed foundational coursework and exploratory projects. I am actively seeking opportunities to apply and expand this skillset through practical implementation."
    },
    {
      "name": "Generative AI",
      "type": "AI Development",
      "level": "Expert",
      "years": "2+",
      "details": "I have quickly become proficient in utilizing Generative AI tools and APIs for content creation, including documents, images, videos, and slides. While effective API integration and account management are key, I also possess the ability to deploy and manage open-source Generative AI models on GPU-equipped machines using Python, addressing challenges related to dependency management and optimizing for cost and speed. I am actively evaluating and implementing open-source alternatives as they approach the performance of leading proprietary models."
    },
    {
      "name": "A2A",
      "type": "AI Development / System Integration",
      "level": "Intermediate",
      "years": "<1",
      "details": "I have experience designing and implementing Agent to Agent (A2A) communication systems to orchestrate complex tasks and workflows. I have specifically worked with connecting and integrating third-party agent systems within the Gemini ecosystem, leveraging their capabilities to create cohesive and automated solutions. My expertise includes establishing communication protocols and managing data flow between diverse AI agents."
    },
    {
      "name": "MCP",
      "type": "AI Orchestration",
      "level": "Expert",
      "years": "2+",
      "details": " have been consistently integrating FastMCP into my AI orchestration development workflows for over two years, leveraging its ease of implementation to enhance the modularity and reusability of tasks built with frameworks like CrewAI and LangChain. I have experience deploying and maintaining FastMCP servers, although I find its greatest utility lies in accelerating development and streamlining testing phases."
    },
    {
      "name": "SAP",
      "type": "Business Intelligence",
      "level": "Intermediate",
      "years": "1+",
      "details": "While a traditionally established system, SAP’s potential is being revitalized through AI-driven advancements. I’ve focused on leveraging SAP to create a unified view of inventory, cost, and resource management, particularly at Bright Tech, with the goal of providing a robust foundation for advanced orchestration and AI development initiatives."
    },
    {
      "name": "Snowflake",
      "type": "Data Warehouse / Data Engineering",
      "level": "Expert",
      "years": "7+",
      "details": "I am a highly proficient user of the Snowflake data cloud platform, with experience connecting it to Power BI via APIs and shared keys, building data archiving ETLs to improve application responsiveness, and denormalizing data to facilitate efficient data extraction for AI queries. I am a strong advocate for Snowflake and recognize its versatility and performance capabilities."
    },
    {
      "name": "Databricks",
      "type": "Data Engineering / AI Infrastructure",
      "level": "Intermediate",
      "years": "1+",
      "details": "I have quickly become proficient with Databricks, leveraging its user-friendly interface and comprehensive documentation to support AI orchestration and data lake implementations. At Bright Tech, Databricks has been instrumental in training, fine-tuning, and supplying data to AI initiatives, as well as enabling the creation of efficient and near-realtime SAP environments for our customers."
    },
    {
      "name": "Streamlit",
      "type": "UI/UX Development",
      "level": "Intermediate",
      "years": "<1",
      "details": "I am proficient with Streamlit, a lightweight Python framework for rapidly building and deploying user interfaces. I’ve found it particularly valuable at Bright Tech for creating UI interfaces for AI chatbots and other applications where a full-fledged JavaScript framework is unnecessary but more functionality is needed than simple scripting provides."
    },
    {
      "name": "Neo4j",
      "type": "Graph Database",
      "level": "Intermediate",
      "years": "2+",
      "details": "I have successfully implemented Neo4j as a graph database to enhance AI-powered systems, particularly Retrieval-Augmented Generation (RAG) pipelines. I've leveraged its capabilities to improve query speed, increase search result relevancy, and reduce data hallucinations. While my focus has been on utilizing Neo4j in conjunction with vector databases rather than optimizing the database itself, I recognize its potential and may expand my expertise in this area."
    },
    {
      "name": "CrewAI",
      "type": "AI Orchestration",
      "level": "Expert",
      "years": "2+",
      "details": "I am highly proficient with CrewAI, leveraging its capabilities to design, orchestrate, and optimize AI agent workflows. I enjoy the creative process of building teams of agents, defining clear requirements, and iteratively improving their performance through prompt engineering and collaboration. I have extensive experience starting projects from scratch with crews and flows, utilizing the CrewAI API functionality to deploy agentic AI solutions to production quickly. CrewAI has proven to be an invaluable tool for automating complex tasks, both professionally and personally, and translating intricate ideas into clean, executable code."
    },
    {
      "name": "Langfuse",
      "type": "AI Monitoring",
      "level": "Expert",
      "years": "2+",
      "details": "I have found Langfuse to be an invaluable tool for sculpting and refining AI performance across numerous projects. Its detailed audit trails allow me to identify and correct poorly prompted agents, validate task execution, and gain insights into the internal workings of LLMs. I leverage Langfuse to implement necessary guardrails and ensure the reliability and desirability of AI-generated results."
    },
    {
      "name": "RAG",
      "type": "AI Development / Data Science",
      "level": "Expert",
      "years": "2+",
      "details": "I have extensive experience building Retrieval-Augmented Generation (RAG) systems, ranging from text-based applications to multimodal systems incorporating slides and images. I’ve developed RAG solutions for both Bright Tech and CellTrak, including several enterprise-grade product, demonstrating my ability to design, implement, and scale robust and effective knowledge retrieval systems."
    },
    {
      "name": "Angular",
      "type": "JavaScript Framework",
      "level": "Intermediate",
      "years": "1+ (professionally)",
      "details": "I have significant experience with Angular, leveraging it extensively during my time at iCrossing. I recently completed a course on Angular 21 with backward compatibility to version 17 to refresh my skills and ensure I can effectively contribute to projects requiring Angular development. I am eager to apply this knowledge in future opportunities."
    },
    {
      "name": "n8n",
      "type": "Low-Code / No-Code / Workflow Automation",
      "level": "Intermediate",
      "years": "<1",
      "details": "I gained hands-on experience with n8n, a no-code workflow automation platform, during my ADaSci certification program. I successfully set up n8n locally and leveraged its plug-and-play functionality to streamline coursework and explore potential integrations with professional projects. I was impressed by its versatility and ease of use."
    },
    {
      "name": "Ollama",
      "type": "Open Source AI Model Server",
      "level": "Expert",
      "years": "<1",
      "details": "I consistently utilize Ollama in my AI development workflows. It's become an essential tool for quickly prototyping agent interactions and significantly reducing costs associated with cloud-based LLM usage. While acknowledging that some open-source LLMs may not match the performance of enterprise models, Ollama offers a valuable balance between accessibility, speed, and affordability."
    },
    {
      "name": "AutoGen",
      "type": "Multi-Agent Framework",
      "level": "Intermediate",
      "years": "<1",
      "details": "I gained hands-on experience with AutoGen during my ADaSci certification program. It provided valuable insight into the capabilities of multi-agent frameworks, bridging the gap between low-code/no-code solutions like n8n and custom agentic AI code. I also gained an understanding of how these systems are implemented within the Microsoft/Azure environment."
    },
    {
      "name": "Multimodal",
      "type": "AI Development / Data Engineering",
      "level": "Expert",
      "years": "2+",
      "details": " I have extensive experience building multimodal AI systems capable of processing a wide range of input formats, including audio files, images, PDFs, documents, API endpoints, and wiki pages. I have also developed systems that generate diverse outputs, such as videos, images, slide decks, and PDFs, demonstrating my ability to create fully integrated and versatile AI solutions."
    },
    {
      "name": "Agentic AI",
      "type": "AI Development / Orchestration",
      "level": "Expert",
      "years": "2+",
      "details": "I have been heavily involved in hands-on Agentic AI work at Bright Tech, focusing on building and deploying AI agents to orchestrate complex tasks within RAG systems. This includes leveraging agents to either enhance existing systems or effectively replace them, demonstrating my ability to design and implement scalable and intelligent agent-based solutions."
    },
    {
      "name": "AGA",
      "type": "AI Ethics / AI Safety",
      "level": "Intermediate",
      "years": "~1",
      "details": "I prioritize Agent Goal Alignment (AGA) in my AI development work, ensuring that AI systems are designed and deployed in a responsible and ethical manner. While much of my experience with AGA is based on academic exploration and discussion, these principles directly inform my approach to architecting and implementing AI solutions."
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Digital Media Production",
      "institution": "Illinois Institute of Art (Schaumburg)"
    }
  ],
  "certificates": [
    {
      "name": "ADaSci Certified Agentic AI System Architect",
      "institution": "ADaSci",
      "link": "https://adasci.org/certifications/adasci-certified-agentic-ai-system-architect",
      "image": null,
      "skills": [
        "RAG",
        "AGA",
        "A2A",
        "MCP",
        "Pinecone",
        "GCP",
        "n8n",
        "Agentic AI",
        "CrewAI",
        "LangChain",
        "Multimodal",
        "LangGraph",
        "CrewAI",
        "Ollama",
        "AutoGen"
      ],
      "description": "This certificate focused on the design, governance, strengths, weaknesses, and best practices of Agentic AI systems through labs and a mix of recorded and live sessions.",
      "credID": "#CERT-20251223-3126",
      "date": "December 2025"
    }
  ],
  "classes": [
    {
      "title": "Practical Multi-AI Agents and Advanced Use Cases with CrewAI",
      "institution": "deeplearning.ai",
      "description": "This course focused on building and deploying multi-agent AI systems using the CrewAI framework. Key topics likely included:, <ul> <li>Multi-agent architecture design for complex AI workflows</li> <li>CrewAI framework fundamentals and advanced features</li> <li>Agent coordination and task delegation strategies</li> <li>Real-world use case implementations (research, content creation, analysis)</li> <li>Advanced prompt engineering for agent interactions</li> <li>Error handling and system optimization techniques</li> <li>The course emphasized practical application of AI agent systems rather than theoretical concepts, with hands-on implementation of multi-agent workflows for various business scenarios.</li></ul> ",
      "link": "https://learn.deeplearning.ai/courses/practical-multi-ai-agents-and-advanced-use-cases-with-crewai/information",
      "completedOn": "February 16, 2023",
      "skills": [
        "CrewAI"
      ]
    },
    {
      "title": "Angular Deep Dive - Beginner to Advanced (Angular 21)",
      "institution": "Udemy",
      "description": "12 hour course that covers Angular 21 and the backwards compatibility to angular 17",
      "link": "https://www.udemy.com/course/angular-course/",
      "completedOn": "Current",
      "skills": [
        "Angular",
        "TypeScript"
      ]
    }
  ],
  "info": {
    "summary": "",
    "conciseSummary": "",
    "coverLetter": ""
  }
}
